/**
 * Снова про Booking.com
 * Надеюсь, это будет кому-то полезным:)
 *
 * Рекрутер вернулась с фидбэком, причём подробным и со звонком (прям на телефон):
 * - да, ты прошёл дальше;
 * - да, вот дата SD Interview;
 * - вот тебе развёрнутый фидбэк от интервьюеров.
 *
 * Что было хорошо:
 * - опрос интервьюеров о корнер-кейсах;
 * - вопрос, стоит ли заботиться об инпуте;
 * - краткое описание способа решения, фиксация ответов в комментариях, все это до кода, прям отметили;
 * - вопрос, на каких деталях они хотели бы, чтобы я больше сфокусировался;
 * - мой комментарий "сейчас вот будет решение в лоб, а как будет рабочее - доработаю";
 * - решение follow-up'ов и задачи в отведённое время, так, что осталось время на мои вопросы;
 * - выслушал рассуждения интервьеров в процессе написания решения и сделал соответствующие проверки и, когда требовалось, исправлял логику.
 */
